<template>
    <div class="uslug2  p992:pt-[155px]">
        <div class="container">
            <LayoutInfotext title="Услуги" color="black" data-aos="fade-right"/>

            <div class="btn-con flex flex-wrap justify-evenly mt-[15px]">
                <button  data-aos="zoom-in"
            class="btn-u w-[200px] leading-none text-[15px] px-4 py-1 m-1 border-none rounded-md cursor-pointer bg-[#292D31] text-white transition-colors duration-300 ease-in-out hover:bg-gray-400"
                :class="{ active: currentText === 'text1' }" 
                @click="showText('text1')">Международные- мультимодальные
            </button>
            <button  data-aos="zoom-in"
               class="btn-u w-[200px] leading-none text-[15px] px-4 py-1 m-1 border-none rounded-md cursor-pointer bg-[#292D31] text-white transition-colors duration-300 ease-in-out hover:bg-gray-400"
                :class="{ active: currentText === 'text2' }" 
                @click="showText('text2')">Автомобильные грузоперевозки
            </button>
            <button  data-aos="zoom-in"
            class="btn-u w-[200px] leading-none text-[15px] px-4 py-1 m-1 border-none rounded-md cursor-pointer bg-[#292D31] text-white transition-colors duration-300 ease-in-out hover:bg-gray-400"
                :class="{ active: currentText === 'text3' }" 
                @click="showText('text3')">Железнодорожные перевозки
            </button>
            <button data-aos="zoom-in"
            class="btn-u w-[200px] leading-none text-[15px] px-4 py-1 m-1 border-none rounded-md cursor-pointer bg-[#292D31] text-white transition-colors duration-300 ease-in-out hover:bg-gray-400"
                :class="{ active: currentText === 'text4' }" 
                @click="showText('text4')">Авиаперевозки + Авиакарго
            </button>
            <button  data-aos="zoom-in"
            class="btn-u w-[200px] leading-none text-[15px] px-4 py-1 m-1 border-none rounded-md cursor-pointer bg-[#292D31] text-white transition-colors duration-300 ease-in-out hover:bg-gray-400"
                :class="{ active: currentText === 'text5' }" 
                @click="showText('text5')">4PL логистика
            </button>
            <button data-aos="zoom-in"
            class="btn-u w-[200px] leading-none text-[15px] px-4 py-1 m-1 border-none rounded-md cursor-pointer bg-[#292D31] text-white transition-colors duration-300 ease-in-out hover:bg-gray-400"
                :class="{ active: currentText === 'text6' }" 
                @click="showText('text6')">Перевозка сборных грузов
            </button>
            </div>
   

            <!-- Текстовые блоки -->
            <article class="pl-[10px] p480:pl-[50px] pr-[10px]">


                <!-- ~~~~~~~~~~~~~~~~~~~~~~~~~1 -->
                <div v-if="currentText === 'text1'" class="text-block">
                    <div class="txt-l flex items-center gap-4">
                        <div class="block-red-txt bg-[#f00]  w-[5px] h-[50px]"></div>
                        <h3 class="text-[18px] font-bold" data-aos="fade-right">Международные- мультимодальные</h3>
                    </div>
                    <p class="text-[18px] mt-[15px] mb-[25px] font-mono text-black text-center p480:text-left">Наша транспортно – экспедиторская компания предлагает широкий спектр международных мультимодальных перевозок, контролируя груз на каждом этапе его движения, эффективно используя морской, автомобильный, авиационный и железнодорожный транспорт. Совмещая преимущества всех видов транспорта, мы разрабатываем и осуществляем международную перевозку, отвечающую Вашим требованиям по скорости доставки и цене.</p>
                    <div class="info-text text-[18px] text-center p480:text-left" data-aos="zoom-in">
                        <p class="font-semibold mb-[25px] text-[20px]">В пакет наших услуг по мультимодальным перевозкам входит:</p>
                        <span class="text-[#f00]">•</span>
                        Поиск быстрого и экономичного маршрута доставки, согласование с грузовладельцем
                        <br>
                        <span class="text-[#f00]">•</span>
                        Забор груза со склада отправителя
                        <br>
                        <span class="text-[#f00]">•</span>
                        Оформление всех необходимых документов и разрешений на отправку груза
                        <br>
                        <span class="text-[#f00]">•</span>
                        Оформление транзитных и других разрешений в процессе доставки
                        <br>
                        <span class="text-[#f00]">•</span>
                        При необходимости перевалка груза из одного транспортного средства в другое
                        <br>
                        <span class="text-[#f00]">•</span>
                        Доставка груза в целости и сохранности до места назначения
                        <br>
                        <span class="text-[#f00]">•</span>
                        Страхование груза по всему маршруту перевозки
                        <br>
                        <span class="text-[#f00]">•</span>
                        Оформление, таможенная очистка и локальная автодоставка груза до «дверей» получателя. Основные направления наших услуг
                        <br>
                        <span class="text-[#f00]">•</span>
                        по мультимодальным перевозкам
                        <br>
                        <span class="text-[#f00]">•</span>
                        Из стран Юго-Восточной Азии (Китай, Южная Корея, Япония и др.) в страны СНГ
                        <br>
                        <span class="text-[#f00]">•</span>
                        Из стран СНГ (Россия, Казахстан, Узбекистан, Кыргызстан и др.) в страны Юго-Восточной Азии
                        <br>
                        <span class="text-[#f00]">•</span>
                        Из стран Европы (Франция, Германия, Нидерланды, Испания, Италия, Латвия, Литва, Эстония) в страны СНГ
                        <br>
                        <p class="font-semibold my-[25px] text-[20px]">Через наземные погранпереходы:</p>
                        <span class="text-[#f00]">•</span>
                        Достык (Алашанкоу), Алтынколь (Хоргос)
                        <br>
                        <span class="text-[#f00]">•</span>
                        Забайкальск (Манчжурия)
                        <br>
                        <span class="text-[#f00]">•</span>
                        Брест (Малашевичи)
                    </div>



                </div>
                <!-- ~~~~~~~~~~~~~~~~~~~~~~~~~2 -->

                <div v-if="currentText === 'text2'" class="text-block">
                    <div class="txt-l flex items-center gap-4">
                        <div class="block-red-txt bg-[#f00]  w-[5px] h-[50px]"></div>
                        <h3 class="text-[18px] font-bold" data-aos="fade-right">Автомобильные грузоперевозки</h3>
                    </div>
                    <p class="text-[18px] mt-[15px] mb-[25px] font-mono text-black text-center p480:text-left">Наша компания одна из ведущих компаний в СНГ, оказывающих услуги автоперевозки и доставки грузов. Мы осуществляем доставку стандартных грузов, сборных, экспресс-грузов, опасных грузов, требующих специальных условий транспортировки, негабаритных и тяжеловесных отправок. Наши заказчики всегда могут получить полную информацию о местонахождении груза о планируемых датах загрузки, отправки и прибытия в пункт назначения. Предоставляем ТЕНТЫ, РЕФРИЖЕРАТОРЫ, АВТОПОЕЗДА (от 80 до 120куб.м.) и АВТО КОНСОЛИДАЦИЮ (20 куб., от 86 до 96 куб., мега 120 куб.).</p>
                    <div class="info-text text-[18px] text-center p480:text-left" data-aos="zoom-in">
                        <p class="font-semibold mb-[25px] text-[20px]">Предоставим:</p>
                        <span class="text-[#f00]">•</span>
                        Расчет стоимости во всех возможных вариациях оплаты
                        <br>
                        <span class="text-[#f00]">•</span>
                        Подбор транспортного средства, соответствующего типу груза
                        <br>
                        <span class="text-[#f00]">•</span>
                        Лицензии на грузоперевозку специфического или опасного груза
                        <br>
                        <span class="text-[#f00]">•</span>
                        Контроль на всех этапах проекта (подача, загрузка, переходы границ, взвешивание, выгрузка)
                        <br>
                        <span class="text-[#f00]">•</span>
                        Консультация специалиста по вопросам заключения контракта (заявки, актов выполненных работ, оплат), СМР, ТИР, сертификатов происхождения и тд.
                        <br>
                        <span class="text-[#f00]">•</span>
                        Импортный и экспортный таможенный транзит
                        <br>
                        <span class="text-[#f00]">•</span>
                        Сертификация грузов при ввозе на территорию Узбекистана
                        <br>
                        <span class="text-[#f00]">•</span>
                        Определение кодов ТН ВЭД при таможенной очистке
                        <br>
                        <span class="text-[#f00]">•</span>
                        Вооруженная охрана дорогостоящих грузов (конвой)         
                    </div>



                </div>
                <!-- ~~~~~~~~~~~~~~~~~~~~~~~~~3 -->
                <div v-if="currentText === 'text3'" class="text-block">
                    <div class="txt-l flex items-center gap-4">
                        <div class="block-red-txt bg-[#f00]  w-[5px] h-[50px]"></div>
                        <h3 class="text-[18px] font-bold" data-aos="fade-right">Железнодорожные перевозки</h3>
                    </div>
                    <p class="text-[18px] mt-[15px] mb-[25px] font-mono text-black text-center p480:text-left">Организация международных железнодорожных перевозок является одним из профилей нашей компании. С помощью нашей компании вы можете отправить грузы в крытых вагонах, полувагонах, цистернах, на платформах, в термос-вагонах, контейнерах разных типов. Наши сотрудники, обладая огромным опытом работы проконсультируют вас о порядке и правилах организации международных перевозок грузов по железной дороге, произведут расчет тарифных ставок по доставке груза от пункта отправления в пункт назначения и помогут решить вопросы, связанные с оформлением и организацией перевозки.</p>
                    <div class="info-text text-[18px] text-center p480:text-left" data-aos="zoom-in">
                        <p class="font-semibold mb-[25px] text-[20px]">В пакет наших услуг по железнодорожным перевозкам входит:</p>
                        <span class="text-[#f00]">•</span>
                        Подсыл вагона на погрузку по собственному договору оперирования
                        <br>
                        <span class="text-[#f00]">•</span>
                        Погрузочно-разгрузочные работы (при помощи специального оборудования)
                        <br>
                        <span class="text-[#f00]">•</span>
                        Крепление груза в вагонах
                        <br>
                        <span class="text-[#f00]">•</span>
                        Оформление необходимых для отправки документов, при необходимости согласование особых условий перевозки с ж.д. администрациями
                        <br>
                        <span class="text-[#f00]">•</span>
                        Получение плана на отправку вагона, оплата станционных услуг
                        <br>
                        <span class="text-[#f00]">•</span>
                        Контроль за движением грузов на всех этапах перевозки по территории стран СНГ и Балтии
                        <br>
                        <span class="text-[#f00]">•</span>
                        Размещение вагонов на хранение, подсыл вагонов и оформление возврата порожних
                        <br>
                        <span class="text-[#f00]">•</span>
                        Оперативное информирование о ходе выполнения перевозки и местонахождении вагона      
                    </div>



                </div>
                <!-- ~~~~~~~~~~~~~~~~~~~~~~~~~4 -->
                <div v-if="currentText === 'text4'" class="text-block">
                    <div class="txt-l flex items-center gap-4">
                        <div class="block-red-txt bg-[#f00]  w-[5px] h-[50px]"></div>
                        <h3 class="text-[18px] font-bold" data-aos="fade-right">Авиаперевозки</h3>
                    </div>
                    <p class="text-[18px] mt-[15px] mb-[25px] font-mono text-black text-center p480:text-left">Услуги по грузовым авиаперевозкам "от двери" до "двери". Наряду с авто, жд, морскими и др., компания SPACE EXPRESS оказывает услуги по грузовым авиаперевозкам в любую точку мира по принципу доставки «от двери до двери» (вид авиаперевозки, при котором груз забирается нашими сотрудниками с условного склада и доставляется непосредственно до пункта назначения). Осуществляя международные авиаперевозки, наши специалисты могут также взять на себя весь процесс подготовки груза к авиаперевозкам — начиная с маркировки и транспортной упаковки перевозимого, до взвешивания и оформления товара на таможне. Кроме того, если ваш груз требует операций по импортно-экспортному оформлению — мы можем обеспечить их своевременное прохождение, и наличие сопроводительных документов (сертификатов, СЭЗ и прочих).</p>
                    <div class="info-text text-[18px] text-center p480:text-left" data-aos="zoom-in">
                        <p class="font-semibold mb-[25px] text-[20px]">При организации авиаперевозок наша компания использует:</p>
                        <span class="text-[#f00]">•</span>
                        Регулярные пассажирские рейсы
                        <br>
                        <span class="text-[#f00]">•</span>
                        Рейсы, выполняемые грузовыми самолетами, что необходимо при – авиаперевозках тяжелых и крупногабаритных грузов
                        <br>
                        <span class="text-[#f00]">•</span>
                        Чартерные рейсы, если необходима авиаперевозка с арендой целого – самолета
                        <p class="font-semibold my-[25px] text-[20px]">Преимущества услуг нашей компании:</p>
                        <span class="text-[#f00]">•</span>
                        Берем растаможку на себя
                        <br>
                        <span class="text-[#f00]">•</span>
                        Вам нет нужды провожать, встречать, загружать и выгружать перевозимые предметы
                        <br>
                        <span class="text-[#f00]">•</span>
                        Все проблемы по доставке груза мы решим за вас сами
                        <br>
                        <span class="text-[#f00]">•</span>
                        Расчёт тарифов базируется на базе выгоднейших расценок зарубежных авиакомпаний и с учётом требований по условиям доставки
                        <br>
                        <span class="text-[#f00]">•</span>
                        Обратившись к нам, вы сэкономите массу бесценного времени и нервов, которые обычно расходуются впустую в очередях, при ожидании регистрации или оформления
                    </div>



                </div>
                 <!-- ~~~~~~~~~~~~~~~~~~~~~~~~~4 -->
                <div v-if="currentText === 'text5'" class="text-block">
                    <div class="txt-l flex items-center gap-4">
                        <div class="block-red-txt bg-[#f00]  w-[5px] h-[50px]"></div>
                        <h3 class="text-[18px] font-bold" data-aos="fade-right">4PL логистика</h3>
                    </div>
                    <p class="text-[18px] mt-[15px] mb-[25px] font-mono text-black text-center p480:text-left">Группа компаний SPACE EXPRESS предоставляет своим Клиентам комплекс услуг в качестве оператора 4PL логистики. Учитывая особенности бизнеса каждого нашего Клиента, мы стараемся предложить такой комплекс услуг, который позволит минимизировать риски ошибок в цепочке поставок - с одной стороны, и оптимизировать затраты на качественное управление цепочкой поставок собственными силами клиента - с другой.</p>
                    <div class="info-text text-[18px] text-center p480:text-left" data-aos="zoom-in">
                        <p class="font-semibold mb-[25px] text-[20px]">Комплекс услуг по обслуживанию внешнеторговых поставок может включать:</p>
                        <span class="text-[#f00]">•</span>
                        Поиск товара, удовлетворяющий потребности покупателя
                        <br>
                        <span class="text-[#f00]">•</span>
                        Консультирование по внешнеторговым сделкам и документам, включая подготовку и проверку документов
                        <br>
                        <span class="text-[#f00]">•</span>
                        Промежуточное, консигнационное или длительное хранение товара
                        <br>
                        <span class="text-[#f00]">•</span>
                        Доставку (FTL, LTL, мультимодальная FCL/LCL, негабаритная)
                        <br>
                        <span class="text-[#f00]">•</span>
                        Дистрибуция (конечная доставка) товара
                        <p class="font-semibold my-[25px] text-[20px]">Преимущества 4PL оператора:</p>
                        <span class="text-[#f00]">•</span>
                        Заказчик экономит время – при выведении всех логистических процессов на аутсорсинг 4PL-оператору, заказчик может сосредоточиться на первостепенной для себя бизнес-задаче, перенаправив сэкономленное время на выполнение своих профильных задач
                        <br>
                        <span class="text-[#f00]">•</span>
                        Вам нет нужды провожать, встречать, загружать и выгружать перевозимые предметы
                        <br>
                        <span class="text-[#f00]">•</span>
                        Распределение ответственности - заказчик отдаёт 4PL-оператору управление значимыми процессами цепочки поставок, тем самым поддерживает с их помощью товарный запас и оперативность исполнения заказов, снимая с себя ответственность за данный процесс
                        <br>
                        <span class="text-[#f00]">•</span>
                        Оперативный и удобный канал дистрибуции – в то время как меняются потребительские потребности, 4PL-оператор может мгновенно реагировать на конкурентный рынок и оперативно изменять логистику, подстраивая ее под требования заказчика
                        <br>
                        <span class="text-[#f00]">•</span>
                        Передача вспомогательного сервиса профессионалам - 4PL-оператор использует в работе весь накопленный опыт, профессионализм, знания, людские ресурсы и современные технологии для эффективного выполнения вторичных задач заказчика
                        <br>
                        <p class="font-semibold my-[25px] text-[20px]">Доверьте сложные этапы организации перевозок нашим специалистам. Мы знаем как выполнять сложные задачи легко и профессионально.</p>
                    </div>



                </div>
                <!-- ~~~~~~~~~~~~~~~~~~~~~~~~~4 -->
                <div v-if="currentText === 'text6'" class="text-block">
                    <div class="txt-l flex items-center gap-4">
                        <div class="block-red-txt bg-[#f00]  w-[5px] h-[50px]"></div>
                        <h3 class="text-[18px] font-bold" data-aos="fade-right">Перевозка сборных грузов</h3>
                    </div>
                    <p class="text-[18px] mt-[15px] mb-[25px] font-mono text-black text-center p480:text-left">Консолидация сборных грузов – это объединение мало- и среднегабаритных партий товара от различных отправителей на одном складе для одного получателя с дальнейшей транспортировкой консолидированной партии грузов в одном автомобиле. Это позволяет существенно уменьшить стоимость перевозки по сравнению с доставкой грузов по отдельности. SPACE EXPRESS предоставляет современные склады для консолидации во всех странах прикаспийского региона. Ваш груз, вне зависимости от специфики, веса и объема будет забран консолидационным автотранспортом в течении 2х дней с любой точки Европы, РФ для дальнейшей отправки в страны Центральной Азии, в частности Узбекистан. Непосредственно от Ваших отправителей груз поступает на ближайший консолидационный склад нашей компании, где проходит обязательный осмотр. Затем Ваши грузы объединяются с другими партиями и доставляются в конечный пункт назначения. Со складов консолидации доставка сборных грузов организуется не реже одного раза в неделю.</p>
                    <div class="info-text text-[18px] text-center p480:text-left" data-aos="zoom-in">
                        <p class="font-semibold mb-[25px] text-[20px]">В процессе перевозки:</p>
                        <span class="text-[#f00]">•</span>
                        Пересчитывается количество мест и сверяется с данными, указанными в товаросопроводительных документах
                        <br>
                        <span class="text-[#f00]">•</span>
                        Проверяется состояние груза и наличие необходимых для дальнейшей отправки документов
                        <br>
                        <span class="text-[#f00]">•</span>
                        Составляется акт приема груза и переоформление для дальнейшей отправки
                        <br> 
                        <p class="font-semibold my-[25px] text-[20px]">Складские услуги на консолидационных терминалах SPACE EXPRESS в Европе:</p>
                        <span class="text-[#f00]">•</span>
                        Хранение груза, взвешивание
                        <br>
                        <span class="text-[#f00]">•</span>
                        Переупаковка, паллетирование
                        <br>
                        <span class="text-[#f00]">•</span>
                        Маркировка контрольными знаками и стикерами
                        <br>
                        <span class="text-[#f00]">•</span>
                        Переоформление таможенных и товаросопроводительных документов
                        <br>
                        <p class="font-semibold my-[25px] text-[20px]">При необходимости срочной доставки небольших партий грузов, доставка осуществляется напрямую малотоннажными автомобилями.</p>
                    </div>



                </div>
            </article>
        
        </div>
    </div>
</template>

<script setup>
import { ref } from 'vue';

// Устанавливаем начальное значение для отображения первого текста
const currentText = ref('text1');

function showText(textId) {
    currentText.value = textId;
}
</script>

<style scoped>
.text-block {
    margin-top: 20px;
}


.btn-u.active {
    background-color: red; /* Красный цвет для активной кнопки */
    color: white; /* Белый текст на красной кнопке */
}


</style>
